Revit 2024 API
FabricationService.IsValidPaletteIndex Method
 Validates the palette index.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2022
Syntax
C#
public bool IsValidPaletteIndex(
	int paletteIndex
)
Visual Basic
Public Function IsValidPaletteIndex ( _
	paletteIndex As Integer _
) As Boolean
Visual C++
public:
bool IsValidPaletteIndex(
	int paletteIndex
)
Parameters
paletteIndex
Type: System.Int32
 The palette index to check.
Return Value
 True if larger or equal to 0 and less than PaletteCount.
See Also
FabricationService Class
Autodesk.Revit.DB Namespace